app/controllers/images_controller.rb

INSERT INTO "images" ("img_file_name", "img_content_type", "img_file_size", "img_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "images".* FROM "images" WHERE "images"."img_file_name" = $1 LIMIT $2  [["img_file_name", "ChessStart.png"], ["LIMIT", 1]]
---
	def create
		print(params[:img])
		@image = Image.new(img: params[:img])
		print("Below")
		print(@image.img_file_name)
		print("Above")
		if (@image.valid?)
			@image.save
		else
			print(params[:img])
			@image = Image.find_by(img_file_name: params[:img].original_filename)