app/controllers/posts_controller.rb

	def create
		#ADMIN ONLY LOGIC GOES HERE
		if (user_signed_in?)
			@post = Post.create!(author: current_user, content: params[:content], title: params[:title])
---
INSERT INTO "posts" ("content", "title", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "#Header\r\n"], ["title", "Title"], ["author_id", 135], ["created_at", "2017-12-22 04:36:36.312049"], ["updated_at", "2017-12-22 04:36:36.312049"]]

	def edit
		@post = Post.find_by(title: params[:title])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."title" = $1 LIMIT $2  [["title", "Title"], ["LIMIT", 1]]

	def show
		@post = Post.find_by(title: params[:title], draft: false)
		if (@post != nil)
			@content = helpers.markdown(@post.content)
			tag_ids = []
			@post.tags.each do |tag|
				tag_ids.push(tag.id)
			end
			@related_posts = Set.new
			tag_ids.size.downto(0) do |i|
				tags = tag_ids[0...i]
				posts = Post.includes(:tags).where(:id => tags)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."title" = $1 LIMIT $2  [["title", "Title"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE 1=0
SELECT "tags".* FROM "tags" INNER JOIN "tags_to_posts" ON "tags"."id" = "tags_to_posts"."tag_id" WHERE "tags_to_posts"."post_id" = $1  [["post_id", 3]]
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def index
		@posts = Post.order('created_at DESC').where(draft: false)
---
SELECT "posts".* FROM "posts" WHERE "posts"."draft" = $1 ORDER BY created_at DESC  [["draft", "f"]]