app/controllers/projects_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Adam Hynson"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" ORDER BY created_at DESC
SELECT  "projects".* FROM "projects" WHERE "projects"."name" = $1 LIMIT $2  [["name", "Chess"], ["LIMIT", 1]]
---
	def portfolio
		@user = User.find_by(name: "Adam Hynson")
		@posts = Post.order('created_at DESC')[0..2]
		@snacker_tracker = Project.find_by(name: "Snacker Tracker")